PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/ip/cyip_appcpuss.h
/***************************************************************************//**
* \file cyip_appcpuss.h
*
* \brief
* APPCPUSS IP definitions
*
********************************************************************************
* \copyright
* (c) (2016-2025), Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation.
*
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#ifndef _CYIP_APPCPUSS_H_
#define _CYIP_APPCPUSS_H_

#include "cyip_headers.h"

/*******************************************************************************
*                                   APPCPUSS
*******************************************************************************/

#define APPCPUSS_SECTION_SIZE                   0x00004000UL

/**
  * \brief APPCPUSS registers (APPCPUSS)
  */
typedef struct
{
    __IM uint32_t IDENTITY;                      /*!< 0x00000000 Identity */
    __IM uint32_t RESERVED[3];
    __IM uint32_t PRODUCT_ID;                    /*!< 0x00000010 Product identifier and version (same as CoreSight RomTables) */
    __IM uint32_t RESERVED1[3];
    __IM uint32_t DP_STATUS;                     /*!< 0x00000020 Debug port status */
    __IM uint32_t RESERVED2[3];
    __IOM uint32_t BUFF_CTL;                      /*!< 0x00000030 Buffer control */
    __IM uint32_t RESERVED3[7];
    __IOM uint32_t INFRA_CTL;                     /*!< 0x00000050 Infrastructure Control */
    __IM uint32_t RESERVED4[43];
    __IOM uint32_t SYSTICK_S_CTL;                 /*!< 0x00000100 Secure SysTick timer control */
    __IM uint32_t RESERVED5[7];
    __IOM uint32_t SYSTICK_NS_CTL;                /*!< 0x00000120 Non Secure SysTick timer control */
    __IM uint32_t RESERVED6[55];
    __IOM uint32_t INTR_MSC;                      /*!< 0x00000200 Master security controller Interrupt */
    __IM uint32_t RESERVED7;
    __IOM uint32_t INTR_MASK_MSC;                 /*!< 0x00000208 Master security controller Interrupt mask */
    __IM uint32_t INTR_MASKED_MSC;               /*!< 0x0000020C Master security controller Interrupt masked */
    __IM uint32_t RESERVED8[60];
    __IOM uint32_t INTR_AHB2AXI;                  /*!< 0x00000300 AHB to AXI Bridge Interrupt */
    __IOM uint32_t INTR_SET_AHB2AXI;              /*!< 0x00000304 AHB to AXI Bridge Interrupt set */
    __IOM uint32_t INTR_MASK_AHB2AXI;             /*!< 0x00000308 AHB to AXI Bridge Interrupt mask */
    __IM uint32_t INTR_MASKED_AHB2AXI;           /*!< 0x0000030C AHB to AXI Bridge Interrupt masked */
    __IM uint32_t RESERVED9[828];
    __IOM uint32_t AP_CTL;                        /*!< 0x00001000 Access port control */
} APPCPUSS_Type;                                /*!< Size = 4100 (0x1004) */


/* APPCPUSS.IDENTITY */
#define APPCPUSS_IDENTITY_P_Pos                 0UL
#define APPCPUSS_IDENTITY_P_Msk                 0x1UL
#define APPCPUSS_IDENTITY_NS_Pos                1UL
#define APPCPUSS_IDENTITY_NS_Msk                0x2UL
#define APPCPUSS_IDENTITY_PC_Pos                4UL
#define APPCPUSS_IDENTITY_PC_Msk                0xF0UL
#define APPCPUSS_IDENTITY_MS_Pos                8UL
#define APPCPUSS_IDENTITY_MS_Msk                0xFF00UL
/* APPCPUSS.PRODUCT_ID */
#define APPCPUSS_PRODUCT_ID_FAMILY_ID_Pos       0UL
#define APPCPUSS_PRODUCT_ID_FAMILY_ID_Msk       0xFFFUL
#define APPCPUSS_PRODUCT_ID_MAJOR_REV_Pos       16UL
#define APPCPUSS_PRODUCT_ID_MAJOR_REV_Msk       0xF0000UL
#define APPCPUSS_PRODUCT_ID_MINOR_REV_Pos       20UL
#define APPCPUSS_PRODUCT_ID_MINOR_REV_Msk       0xF00000UL
/* APPCPUSS.DP_STATUS */
#define APPCPUSS_DP_STATUS_SWJ_CONNECTED_Pos    0UL
#define APPCPUSS_DP_STATUS_SWJ_CONNECTED_Msk    0x1UL
#define APPCPUSS_DP_STATUS_SWJ_DEBUG_EN_Pos     1UL
#define APPCPUSS_DP_STATUS_SWJ_DEBUG_EN_Msk     0x2UL
#define APPCPUSS_DP_STATUS_SWJ_JTAG_SEL_Pos     2UL
#define APPCPUSS_DP_STATUS_SWJ_JTAG_SEL_Msk     0x4UL
#define APPCPUSS_DP_STATUS_SWJ_SWD_SEL_Pos      3UL
#define APPCPUSS_DP_STATUS_SWJ_SWD_SEL_Msk      0x8UL
/* APPCPUSS.BUFF_CTL */
#define APPCPUSS_BUFF_CTL_WRITE_BUFF_Pos        0UL
#define APPCPUSS_BUFF_CTL_WRITE_BUFF_Msk        0x1UL
/* APPCPUSS.INFRA_CTL */
#define APPCPUSS_INFRA_CTL_CLOCK_FORCE_Pos      0UL
#define APPCPUSS_INFRA_CTL_CLOCK_FORCE_Msk      0x1UL
/* APPCPUSS.SYSTICK_S_CTL */
#define APPCPUSS_SYSTICK_S_CTL_TENMS_Pos        0UL
#define APPCPUSS_SYSTICK_S_CTL_TENMS_Msk        0xFFFFFFUL
#define APPCPUSS_SYSTICK_S_CTL_CLOCK_SOURCE_Pos 24UL
#define APPCPUSS_SYSTICK_S_CTL_CLOCK_SOURCE_Msk 0x3000000UL
#define APPCPUSS_SYSTICK_S_CTL_SKEW_Pos         30UL
#define APPCPUSS_SYSTICK_S_CTL_SKEW_Msk         0x40000000UL
#define APPCPUSS_SYSTICK_S_CTL_NOREF_Pos        31UL
#define APPCPUSS_SYSTICK_S_CTL_NOREF_Msk        0x80000000UL
/* APPCPUSS.SYSTICK_NS_CTL */
#define APPCPUSS_SYSTICK_NS_CTL_TENMS_Pos       0UL
#define APPCPUSS_SYSTICK_NS_CTL_TENMS_Msk       0xFFFFFFUL
#define APPCPUSS_SYSTICK_NS_CTL_CLOCK_SOURCE_Pos 24UL
#define APPCPUSS_SYSTICK_NS_CTL_CLOCK_SOURCE_Msk 0x3000000UL
#define APPCPUSS_SYSTICK_NS_CTL_SKEW_Pos        30UL
#define APPCPUSS_SYSTICK_NS_CTL_SKEW_Msk        0x40000000UL
#define APPCPUSS_SYSTICK_NS_CTL_NOREF_Pos       31UL
#define APPCPUSS_SYSTICK_NS_CTL_NOREF_Msk       0x80000000UL
/* APPCPUSS.INTR_MSC */
#define APPCPUSS_INTR_MSC_SYS_MS0_MSC_Pos       0UL
#define APPCPUSS_INTR_MSC_SYS_MS0_MSC_Msk       0x1UL
#define APPCPUSS_INTR_MSC_SYS_MS1_MSC_Pos       1UL
#define APPCPUSS_INTR_MSC_SYS_MS1_MSC_Msk       0x2UL
#define APPCPUSS_INTR_MSC_AXIDMAC0_MSC_Pos      2UL
#define APPCPUSS_INTR_MSC_AXIDMAC0_MSC_Msk      0x4UL
#define APPCPUSS_INTR_MSC_AXIDMAC1_MSC_Pos      3UL
#define APPCPUSS_INTR_MSC_AXIDMAC1_MSC_Msk      0x8UL
#define APPCPUSS_INTR_MSC_AXI_MS0_MSC_Pos       4UL
#define APPCPUSS_INTR_MSC_AXI_MS0_MSC_Msk       0x10UL
#define APPCPUSS_INTR_MSC_AXI_MS1_MSC_Pos       5UL
#define APPCPUSS_INTR_MSC_AXI_MS1_MSC_Msk       0x20UL
#define APPCPUSS_INTR_MSC_AXI_MS2_MSC_Pos       6UL
#define APPCPUSS_INTR_MSC_AXI_MS2_MSC_Msk       0x40UL
#define APPCPUSS_INTR_MSC_AXI_MS3_MSC_Pos       7UL
#define APPCPUSS_INTR_MSC_AXI_MS3_MSC_Msk       0x80UL
#define APPCPUSS_INTR_MSC_EXP_MS0_MSC_Pos       8UL
#define APPCPUSS_INTR_MSC_EXP_MS0_MSC_Msk       0x100UL
#define APPCPUSS_INTR_MSC_EXP_MS1_MSC_Pos       9UL
#define APPCPUSS_INTR_MSC_EXP_MS1_MSC_Msk       0x200UL
#define APPCPUSS_INTR_MSC_EXP_MS2_MSC_Pos       10UL
#define APPCPUSS_INTR_MSC_EXP_MS2_MSC_Msk       0x400UL
#define APPCPUSS_INTR_MSC_EXP_MS3_MSC_Pos       11UL
#define APPCPUSS_INTR_MSC_EXP_MS3_MSC_Msk       0x800UL
/* APPCPUSS.INTR_MASK_MSC */
#define APPCPUSS_INTR_MASK_MSC_SYS_MS0_MSC_Pos  0UL
#define APPCPUSS_INTR_MASK_MSC_SYS_MS0_MSC_Msk  0x1UL
#define APPCPUSS_INTR_MASK_MSC_SYS_MS1_MSC_Pos  1UL
#define APPCPUSS_INTR_MASK_MSC_SYS_MS1_MSC_Msk  0x2UL
#define APPCPUSS_INTR_MASK_MSC_AXIDMAC0_MSC_Pos 2UL
#define APPCPUSS_INTR_MASK_MSC_AXIDMAC0_MSC_Msk 0x4UL
#define APPCPUSS_INTR_MASK_MSC_AXIDMAC1_MSC_Pos 3UL
#define APPCPUSS_INTR_MASK_MSC_AXIDMAC1_MSC_Msk 0x8UL
#define APPCPUSS_INTR_MASK_MSC_AXI_MS0_MSC_Pos  4UL
#define APPCPUSS_INTR_MASK_MSC_AXI_MS0_MSC_Msk  0x10UL
#define APPCPUSS_INTR_MASK_MSC_AXI_MS1_MSC_Pos  5UL
#define APPCPUSS_INTR_MASK_MSC_AXI_MS1_MSC_Msk  0x20UL
#define APPCPUSS_INTR_MASK_MSC_AXI_MS2_MSC_Pos  6UL
#define APPCPUSS_INTR_MASK_MSC_AXI_MS2_MSC_Msk  0x40UL
#define APPCPUSS_INTR_MASK_MSC_AXI_MS3_MSC_Pos  7UL
#define APPCPUSS_INTR_MASK_MSC_AXI_MS3_MSC_Msk  0x80UL
#define APPCPUSS_INTR_MASK_MSC_EXP_MS0_MSC_Pos  8UL
#define APPCPUSS_INTR_MASK_MSC_EXP_MS0_MSC_Msk  0x100UL
#define APPCPUSS_INTR_MASK_MSC_EXP_MS1_MSC_Pos  9UL
#define APPCPUSS_INTR_MASK_MSC_EXP_MS1_MSC_Msk  0x200UL
#define APPCPUSS_INTR_MASK_MSC_EXP_MS2_MSC_Pos  10UL
#define APPCPUSS_INTR_MASK_MSC_EXP_MS2_MSC_Msk  0x400UL
#define APPCPUSS_INTR_MASK_MSC_EXP_MS3_MSC_Pos  11UL
#define APPCPUSS_INTR_MASK_MSC_EXP_MS3_MSC_Msk  0x800UL
/* APPCPUSS.INTR_MASKED_MSC */
#define APPCPUSS_INTR_MASKED_MSC_SYS_MS0_MSC_Pos 0UL
#define APPCPUSS_INTR_MASKED_MSC_SYS_MS0_MSC_Msk 0x1UL
#define APPCPUSS_INTR_MASKED_MSC_SYS_MS1_MSC_Pos 1UL
#define APPCPUSS_INTR_MASKED_MSC_SYS_MS1_MSC_Msk 0x2UL
#define APPCPUSS_INTR_MASKED_MSC_AXIDMAC0_MSC_Pos 2UL
#define APPCPUSS_INTR_MASKED_MSC_AXIDMAC0_MSC_Msk 0x4UL
#define APPCPUSS_INTR_MASKED_MSC_AXIDMAC1_MSC_Pos 3UL
#define APPCPUSS_INTR_MASKED_MSC_AXIDMAC1_MSC_Msk 0x8UL
#define APPCPUSS_INTR_MASKED_MSC_AXI_MS0_MSC_Pos 4UL
#define APPCPUSS_INTR_MASKED_MSC_AXI_MS0_MSC_Msk 0x10UL
#define APPCPUSS_INTR_MASKED_MSC_AXI_MS1_MSC_Pos 5UL
#define APPCPUSS_INTR_MASKED_MSC_AXI_MS1_MSC_Msk 0x20UL
#define APPCPUSS_INTR_MASKED_MSC_AXI_MS2_MSC_Pos 6UL
#define APPCPUSS_INTR_MASKED_MSC_AXI_MS2_MSC_Msk 0x40UL
#define APPCPUSS_INTR_MASKED_MSC_AXI_MS3_MSC_Pos 7UL
#define APPCPUSS_INTR_MASKED_MSC_AXI_MS3_MSC_Msk 0x80UL
#define APPCPUSS_INTR_MASKED_MSC_EXP_MS0_MSC_Pos 8UL
#define APPCPUSS_INTR_MASKED_MSC_EXP_MS0_MSC_Msk 0x100UL
#define APPCPUSS_INTR_MASKED_MSC_EXP_MS1_MSC_Pos 9UL
#define APPCPUSS_INTR_MASKED_MSC_EXP_MS1_MSC_Msk 0x200UL
#define APPCPUSS_INTR_MASKED_MSC_EXP_MS2_MSC_Pos 10UL
#define APPCPUSS_INTR_MASKED_MSC_EXP_MS2_MSC_Msk 0x400UL
#define APPCPUSS_INTR_MASKED_MSC_EXP_MS3_MSC_Pos 11UL
#define APPCPUSS_INTR_MASKED_MSC_EXP_MS3_MSC_Msk 0x800UL
/* APPCPUSS.INTR_AHB2AXI */
#define APPCPUSS_INTR_AHB2AXI_BUFF_WRITE_ERR_Pos 0UL
#define APPCPUSS_INTR_AHB2AXI_BUFF_WRITE_ERR_Msk 0x1UL
/* APPCPUSS.INTR_SET_AHB2AXI */
#define APPCPUSS_INTR_SET_AHB2AXI_BUFF_WRITE_ERR_Pos 0UL
#define APPCPUSS_INTR_SET_AHB2AXI_BUFF_WRITE_ERR_Msk 0x1UL
/* APPCPUSS.INTR_MASK_AHB2AXI */
#define APPCPUSS_INTR_MASK_AHB2AXI_BUFF_WRITE_ERR_Pos 0UL
#define APPCPUSS_INTR_MASK_AHB2AXI_BUFF_WRITE_ERR_Msk 0x1UL
/* APPCPUSS.INTR_MASKED_AHB2AXI */
#define APPCPUSS_INTR_MASKED_AHB2AXI_BUFF_WRITE_ERR_Pos 0UL
#define APPCPUSS_INTR_MASKED_AHB2AXI_BUFF_WRITE_ERR_Msk 0x1UL
/* APPCPUSS.AP_CTL */
#define APPCPUSS_AP_CTL_CM55_0_ENABLE_Pos       0UL
#define APPCPUSS_AP_CTL_CM55_0_ENABLE_Msk       0x1UL
#define APPCPUSS_AP_CTL_CM55_1_ENABLE_Pos       1UL
#define APPCPUSS_AP_CTL_CM55_1_ENABLE_Msk       0x2UL
#define APPCPUSS_AP_CTL_CM55_0_DBG_ENABLE_Pos   4UL
#define APPCPUSS_AP_CTL_CM55_0_DBG_ENABLE_Msk   0x10UL
#define APPCPUSS_AP_CTL_CM55_0_NID_ENABLE_Pos   5UL
#define APPCPUSS_AP_CTL_CM55_0_NID_ENABLE_Msk   0x20UL
#define APPCPUSS_AP_CTL_CM55_0_SPID_ENABLE_Pos  6UL
#define APPCPUSS_AP_CTL_CM55_0_SPID_ENABLE_Msk  0x40UL
#define APPCPUSS_AP_CTL_CM55_0_SPNID_ENABLE_Pos 7UL
#define APPCPUSS_AP_CTL_CM55_0_SPNID_ENABLE_Msk 0x80UL
#define APPCPUSS_AP_CTL_CM55_1_DBG_ENABLE_Pos   8UL
#define APPCPUSS_AP_CTL_CM55_1_DBG_ENABLE_Msk   0x100UL
#define APPCPUSS_AP_CTL_CM55_1_NID_ENABLE_Pos   9UL
#define APPCPUSS_AP_CTL_CM55_1_NID_ENABLE_Msk   0x200UL
#define APPCPUSS_AP_CTL_CM55_1_SPID_ENABLE_Pos  10UL
#define APPCPUSS_AP_CTL_CM55_1_SPID_ENABLE_Msk  0x400UL
#define APPCPUSS_AP_CTL_CM55_1_SPNID_ENABLE_Pos 11UL
#define APPCPUSS_AP_CTL_CM55_1_SPNID_ENABLE_Msk 0x800UL
#define APPCPUSS_AP_CTL_CM55_0_SECURE_ENABLE_Pos 12UL
#define APPCPUSS_AP_CTL_CM55_0_SECURE_ENABLE_Msk 0x1000UL
#define APPCPUSS_AP_CTL_CM55_1_SECURE_ENABLE_Pos 13UL
#define APPCPUSS_AP_CTL_CM55_1_SECURE_ENABLE_Msk 0x2000UL
#define APPCPUSS_AP_CTL_CM55_0_DISABLE_Pos      16UL
#define APPCPUSS_AP_CTL_CM55_0_DISABLE_Msk      0x10000UL
#define APPCPUSS_AP_CTL_CM55_1_DISABLE_Pos      17UL
#define APPCPUSS_AP_CTL_CM55_1_DISABLE_Msk      0x20000UL
#define APPCPUSS_AP_CTL_CM55_0_DBG_DISABLE_Pos  20UL
#define APPCPUSS_AP_CTL_CM55_0_DBG_DISABLE_Msk  0x100000UL
#define APPCPUSS_AP_CTL_CM55_0_NID_DISABLE_Pos  21UL
#define APPCPUSS_AP_CTL_CM55_0_NID_DISABLE_Msk  0x200000UL
#define APPCPUSS_AP_CTL_CM55_0_SPID_DISABLE_Pos 22UL
#define APPCPUSS_AP_CTL_CM55_0_SPID_DISABLE_Msk 0x400000UL
#define APPCPUSS_AP_CTL_CM55_0_SPNID_DISABLE_Pos 23UL
#define APPCPUSS_AP_CTL_CM55_0_SPNID_DISABLE_Msk 0x800000UL
#define APPCPUSS_AP_CTL_CM55_1_DBG_DISABLE_Pos  24UL
#define APPCPUSS_AP_CTL_CM55_1_DBG_DISABLE_Msk  0x1000000UL
#define APPCPUSS_AP_CTL_CM55_1_NID_DISABLE_Pos  25UL
#define APPCPUSS_AP_CTL_CM55_1_NID_DISABLE_Msk  0x2000000UL
#define APPCPUSS_AP_CTL_CM55_1_SPID_DISABLE_Pos 26UL
#define APPCPUSS_AP_CTL_CM55_1_SPID_DISABLE_Msk 0x4000000UL
#define APPCPUSS_AP_CTL_CM55_1_SPNID_DISABLE_Pos 27UL
#define APPCPUSS_AP_CTL_CM55_1_SPNID_DISABLE_Msk 0x8000000UL
#define APPCPUSS_AP_CTL_CM55_0_SECURE_DISABLE_Pos 28UL
#define APPCPUSS_AP_CTL_CM55_0_SECURE_DISABLE_Msk 0x10000000UL
#define APPCPUSS_AP_CTL_CM55_1_SECURE_DISABLE_Pos 29UL
#define APPCPUSS_AP_CTL_CM55_1_SECURE_DISABLE_Msk 0x20000000UL


#endif /* _CYIP_APPCPUSS_H_ */


/* [] END OF FILE */
